<?php
return [
    'required_tweet' => 'يجب إدخال تغريدة.',
    'max_tweet' => 'يجب ألا تتجاوز التغريدة 140 حرفًا.',
    'username_required' => 'حقل اسم المستخدم مطلوب.',
    'username_no_spaces' => 'لا يمكن أن يحتوي اسم المستخدم على مسافات.',
    'email_required' => 'حقل البريد الإلكتروني مطلوب.',
    'email_format' => 'يجب أن يكون البريد الإلكتروني عنوان بريد إلكتروني صالح.',
    'email_unique' => 'البريد الإلكتروني مسجل بالفعل.',
    'password_required' => 'حقل كلمة المرور مطلوب.',
    'password_min' => 'يجب أن تكون كلمة المرور على الأقل 8 أحرف.',
    'password_format' => 'يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل وحرف صغير واحد ورقم واحد ورمز خاص واحد.',
    'image_format' => 'يجب أن يكون الملف صورة.',
    'image_mimes' => 'يجب أن تكون الصورة من نوع png أو jpg.',
    'image_max' => 'يجب ألا يزيد حجم الصورة عن 1 ميغابايت.',
];
